openenergymonitor/STM32/Software/Sombrero_VE_Working6/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2020 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f3xx_hal.h"
#include "adc.h"
#include "dma.h"
#include "i2c.h"
#include "opamp.h"
#include "rtc.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "usb.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include <time.h>
#include <math.h>
#include <string.h>
#include <stdbool.h>
#include <stdlib.h>
#include "jsmn.h"
#include "reset.h"
#include "json.h"
#include "RFM69.h"
#include "RFM69_ext.h"
//#include "ds18b20.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
// test variables
bool testing = false; // for testing
bool dontGiveAMonkeys = false; // don't wait for a VT adaptor to calculate Irms, AP, RP etc.
bool ledBlink = true; // enable or disable LED blinking.

// version information
char hwVersion[] = "Sombrero_v0.8";
char fwVersion[] = "v0.1";

//-------------
// MODES
//-------------
// 0 = Standalone
// 1 = rPi
// 2 = ESP32
// 3 = testing
int _mode = 0; // init mode


// approximating the BIAS.
#define MID_ADC_READING 2048


//------------------------------------------------
// timing, ADCs, power and frequency variables
//------------------------------------------------
double V_RATIO;
double I_RATIO;
uint32_t posting_interval = 5000; // millis to post data at.
//const double adc_conversion_time = (614.0*(1.0/(72000000.0/4))); // time in seconds for an ADC conversion, for estimating mains AC frequency.
const double adc_conversion_time = (194.0*(1.0/(72000000.0/4))); // time in seconds for an ADC conversion, for estimating mains AC frequency.
//const double adc_conversion_time = (74.0*(1.0/(72000000.0/4))); // seems to be the fastest we can sample.
//const double adc_conversion_time = (32.0*(1.0/(72000000.0/4))); // this speed causes buffer overruns.
double mains_frequency; // as it says.
double Ws_accumulator[CTn] = {0}; // energy accumulator per CT channel.


//------------------------------------------------
// misc. flags
//------------------------------------------------
bool readings_ready = false;
bool readings_requested = false;
bool first_readings = false;


//----------------------------
// CT Settings : Common
//----------------------------


//----------------------------
// CT Settings : Per Channel
//----------------------------


//----------------------------
// VT Settings : Common
//----------------------------


//------------------------
// Channel Accumulators
//------------------------
typedef struct channel_
{
  int64_t sum_P;
  uint64_t sum_V_sq;
  uint64_t sum_I_sq;
  int64_t sum_V;
  int64_t sum_I;
  bool Iclipped; 
  uint32_t count;
  uint32_t cycles;
  bool positive_V;
  bool last_positive_V;
} channel_t; // data struct per CT channel, stm32 only does 32-bit struct items, anything else gets padded out to 32-bit automatically by

static channel_t channels[CTn] = {0};
static channel_t channels_ready[CTn] = {0};
bool channel_rdy_bools[CTn] = {0};


//--------------------------------
// VOLTAGE CALIBRATION
//--------------------------------
const double VOLTS_PER_DIV = (3.3 / 4096.0);
//const double VCAL = 268.97*0.9940357853*0.9947958367; // default ideal power UK, adjusted
//const double VCAL = 268.97;
const double VCAL = 229.7252669065; // measured by DB for testing.
//const double VCAL = 287.5;

//--------------------------------
// AMPERAGE CALIBRATION
//--------------------------------
//const double ICAL = (100/0.05)/22.0; // (CT rated input / rated output) / burden value.
//const double ICAL = (100/0.05)/11.0; // (CT rated input / rated output) / burden value.
const double ICAL = (100/0.05)/6.8; // (CT rated input / rated output) / burden value.
//const double ICAL = (100/0.05)/(26.8); // dan's stm32 consistency check board at 0.2% accuracy burden (53R6 x 2 in parallel).
//const double ICAL = (100/0.05)/50.6; // dan's custom test board.
//const double ICAL = (100/0.05)/456.3; // dan's custom test board.
//const double ICAL = (100/0.05)/1.0; // dan's custom test board.
//const double ICAL = (100/0.05)/(22.0/1000.0);
// const double ICAL = (100.0/0.05)*11.0; // V=I*R. Convert to raw mV signal for testing.


//--------------------------
// PHASE CALIBRATION
//--------------------------
// Finite Impulse Response (FIR) filter-like Power Factor correction.
// This phase correction can be applied to individual CTs.
// This phase-correction works by selecting the relevant sample from the ADC DMA buffer.
// For example ADC1 has buffer 1, ADC2 has buffer 2. The VT is on buffer 1, the CT is on buffer 2.
// We can choose to pair the relevant sample from buffers one and two, to adjust for time differences (phase shift).
// Each sample is separated at a single conversion time, 10.7usecs, for example, or tripple that for 3-phase.
int hunt_PF[CTn] = {0}; // this is a per-channel state trigger. The array index is the CT channel.
// when above array value {0} equals:
// 0 = no power factor hunting, default at program start.
// 1 = power factor hunt start. This can be triggered from a serial command.
// 2 = power factor hunt to the right. (increase VT lead, automatic).
// 3 = power factor hunt to the left. (increase VT lag, automatic).
// 4 = hunt finishing, finding mode average (automatic).
// 5 = hunt complete.

